In [ ]:
#Excel File Handling using pandas Library

#Note: By Default the pd.read_excel() read first sheet only

#Program 1: Read Excel File using Pandas library
#Program 2: Display only 2nd record from the excel file
#Program 3: Display 2nd to 4th record from excel file
#Program 4: Display 2nd and 4th record from excel file
#Program 5: Display 2nd, 3rd and 4th record for column 'Ename' and 'Esalary' from excel file
#Program 6: Dispaly multiple sheets from excel file

In [9]:
#Program 1: Read Excel File using Pandas library

#import pandas library
import pandas as pd

#Read data from excel file and store in variable
    #Note: By default it read the first sheet only, not the entire worksheet see program:6

data = pd.read_excel("emp.xlsx")

data

# OR, Display record in range e.g. index 0 TO 2
# data[0:3]

   Eno   Ename   Edesig  Esalary
0    1  Ename1  Edesig1    10000
1    2  Ename2  Edesig2    20000
2    3  Ename3  Edesig3    30000
3    4  Ename4  Edesig4    40000
4    5  Ename5  Edesig5    50000
5    6  Ename6  Edesig6    60000

In [2]:
# Program 2: Display only 2nd record from the excel file

#import statement
import pandas as pd

#Read excel file
fexcel = pd.read_excel("emp.xlsx")

# Display the record, (Note: The same statement can be written using print())
fexcel.loc[1]

Eno              2
Ename       Ename2
Edesig     Edesig2
Esalary      20000
Name: 1, dtype: object

In [11]:
#Program 3: Display 2nd to 4th record from excel file

#import
import pandas as pd

#Read excel file
fexc = pd.read_excel("emp.xlsx")

#display 2nd to 4th row (Note: Index of first row is '0', heading is not counted)
fexc.loc[1:3]

#OR, 
# fexc[1:4]

   Eno   Ename   Edesig  Esalary
1    2  Ename2  Edesig2    20000
2    3  Ename3  Edesig3    30000
3    4  Ename4  Edesig4    40000

In [34]:
#Program 4: Display 2nd and 4th record from excel file

#import
import pandas as pd

#Read excel file
fexc = pd.read_excel("emp.xlsx")

#display 2nd and 4th row (Note: Index of first row is '0', heading is not counted)
# 2nd record index = 1
# 4th record index = 3
fexc.loc[[1,3]]

   Eno   Ename   Edesig  Esalary
1    2  Ename2  Edesig2    20000
3    4  Ename4  Edesig4    40000

In [23]:
#Program 5: Display 2nd, 3rd and 4th record for column 'Ename' and 'Esalary' from excel file

#import
import pandas as pd

#Read excel file
fexc = pd.read_excel("emp.xlsx")

#Display 2nd, 3rd, 4th record for col 'Ename' and 'Esalary'
fexc.loc[[1,2,3], ['Ename', 'Esalary']]   # Note: can use double or single quotes

    Ename  Esalary
1  Ename2    20000
2  Ename3    30000
3  Ename4    40000

In [36]:
#Program 5: Display 2nd, 3rd and 4th record for column 'Ename' and 'Esalary' from excel file

#import
import pandas as pd

#Read excel file
fexc = pd.read_excel("emp.xlsx")

#Display 2nd, 3rd, 4th record for col 'Ename' and 'Esalary'
fexc.loc[[1,2,3], ['Ename', 'Esalary']]   # Note: can use double or single quotes

    Ename  Esalary
1  Ename2    20000
2  Ename3    30000
3  Ename4    40000

In [33]:
#Program 6: Dispaly multiple sheets from excel file

#Method 1

#import
import pandas as pd

#Read excel file sheets
with pd.ExcelFile("emp.xlsx") as xls:
    sheet1 = pd.read_excel(xls, 'Emp_Details')
    sheet2 = pd.read_excel(xls, 'Emp_Vehical_Details')

print("*****EMPLOYEE DETAILS*****")
#Display entire sheet1
print(sheet1)

# Show sheet 1 first 5 records 
    # print(sheet1[0:5]) 

#show sheet 1 specific column
    # print(sheet1['Ename'])

print(" ")

print("******EMPLOYEE VEHICAL DETAILS******")
#Display entire sheet2
print(sheet2)

*****EMPLOYEE DETAILS*****
   Eno   Ename   Edesig  Esalary
0    1  Ename1  Edesig1    10000
1    2  Ename2  Edesig2    20000
2    3  Ename3  Edesig3    30000
3    4  Ename4  Edesig4    40000
4    5  Ename5  Edesig5    50000
5    6  Ename6  Edesig6    60000

******EMPLOYEE VEHICAL DETAILS******
   Eno EVehical_type Evehical_no
0    1          Bike        V101
1    2         Cycle        V102
2    3           Car        V103
3    4         Cycle        V104
4    5           Gov        V105
5    6           Car        V106

In [21]:
#Program 6: Dispaly multiple sheets from excel file

#Method 2

#import
import pandas as pd

#Read excel file sheets
sheet1 = pd.read_excel("emp.xlsx", ['Emp_Details', 'Emp_Vehical_Details'])

sheet1

{'Emp_Details':    Eno   Ename   Edesig  Esalary
 0    1  Ename1  Edesig1    10000
 1    2  Ename2  Edesig2    20000
 2    3  Ename3  Edesig3    30000
 3    4  Ename4  Edesig4    40000
 4    5  Ename5  Edesig5    50000
 5    6  Ename6  Edesig6    60000,
 'Emp_Vehical_Details':    Eno EVehical_type Evehical_no
 0    1          Bike        V101
 1    2         Cycle        V102
 2    3           Car        V103
 3    4         Cycle        V104
 4    5           Gov        V105
 5    6           Car        V106}